/*
 * 
 */
package develop.service.api.model;

import org.apache.commons.lang3.StringUtils;
 

public enum TaxiStatus {
	/**
	 * SUCCESS
	 */
	SUCCESS("SUCCESS","SUCCESS"),
	
	/** 資料傳遞錯誤_PostData 空白. */
	MEM40012("MEM40012","資料傳遞錯誤_PostData 空白"),
	
	/** 資料缺少 會提示空白欄位. */
	MEM40013("MEM40013","資料缺少 會提示空白欄位"),
	
	/** 資料空白 會提示空白欄位. */
	MEM40008("MEM40008","資料空白 會提示空白欄位"),
		
	/** 傳送時間錯誤. */
	MEM40014("MEM40014","傳送時間錯誤"),
	
	/** 商店代號空白. */
	MPG10001("MPG10001","商店代號空白"),
	
	/** 串接程式版本參數值有誤. */
	MPG10002("MPG10002","串接程式版本參數值有誤"),
	
	/** 回傳格式參數值錯誤. */
	MPG10003("MPG10003","回傳格式參數值錯誤"),
	
	/** TimeStamp 錯誤. */
	MPG10005("MPG10005","TimeStamp 錯誤"),
	
	/** "CheckValue [ 檢查碼 ]空白. */
	MPG10006("MPG10006","CheckValue [ 檢查碼 ]空白"),
	
	/** 查無商店資料. */
	MPG10007("MPG10007","查無商店資料"),
	
	/** CheckValue [ 檢查碼 ]驗證失. */
	MPG10008("MPG10008","CheckValue [ 檢查碼 ]驗證失敗"),
	
	/** 商店訂單編號空白. */
	MPG10009("MPG10009","商店訂單編號空白"),
	
	/** 商店訂單編號格式錯誤. */
	MPG10010("MPG10010","商店訂單編號格式錯誤"),
	
	/** 商店訂單金額空白. */
	MPG10012("MPG10012","商店訂單金額空白"),
	
	/** 金額填入非數字資訊. */
	MPG10013("MPG10013","金額填入非數字資訊"),
	
	/** 訂單金額超過 9999999999. */
	MPG10014("MPG10014","訂單金額超過 9999999999"),
	
	/** 商品資訊空白. */
	MPG10015("MPG10015","商品資訊空白"),
	
	/** 繳費期限日期格式錯誤. */
	MPG10016("MPG10016","繳費期限日期格式錯誤"),
	
	/** 商店狀態關閉或暫停,無法交易. */
	MPG10017("MPG10017","商店狀態關閉或暫停,無法交易"),
	
	/** 商店 Form Post 資料加密失敗. */
	MPG10018("MPG10018","商店 Form Post 資料加密失敗"),
	
	/** 登入智付通會員參數空白. */
	MPG10019("MPG10019","登入智付通會員參數空白"),
	
	/** 回傳參數資料不存在. */
	MPG10020("MPG10020","回傳參數資料不存在"),
	
	/** 回傳參數資料解密失敗. */
	MPG10021("MPG10021","回傳參數資料解密失敗"),
	
	/** 查無商店金流設定資料. */
	MPG10022("MPG10022","查無商店金流設定資料"),
	
	/** 付款人電子信箱格式錯誤. */
	MPG10024("MPG10024","付款人電子信箱格式錯誤"),
	
	/** 信用卡卡號格式錯誤. */
	MPG10028("MPG10028","信用卡卡號格式錯誤"),
	
	/** 未輸入信用卡有效期. */
	MPG10029("MPG10029","未輸入信用卡有效期"),
	
	/** 未輸入信用卡背面末三碼. */
	MPG10030("MPG10030","未輸入信用卡背面末三碼"), 
	
	/**服務未啟用. */
	MPG10031("MPG10031","服務未啟用"),
	
	/** URL 非為 http 或 https 開頭. */
	MPG10036("MPG10036","URL 非為 http 或 https 開頭"),
	
	/** "URL 格式錯誤. */
	MPG10037("MPG10037","URL 格式錯誤"),
	
	/** 禁止使用 localhost 或是 127.0.0.1 的網址格式. */
	MPG10038("MPG10038","禁止使用 localhost 或是 127.0.0.1 的網址格式"),
	
	/** 查無商店開啟任何金流服務,請與客服聯繫 */
	MPG02002("MPG02002","查無商店開啟任何金流服務,請與客服聯繫"),
	
	/** 驗證資料不存在. */
	MPG20001("MPG20001","驗證資料不存在"),
	
	/** 驗證資料空白-商店代號. */
	MPG20002("MPG20002","驗證資料空白-商店代號"),
	
	/** 驗證資料空白-訂單金額. */
	MPG20003("MPG20003","驗證資料空白-訂單金額"),
	
	/** 驗證資料空白-商店自訂訂單編號. */
	MPG20004("MPG20004","驗證資料空白-商店自訂訂單編號"),
	
	/** 頁面停留超過 30 分鐘. */
	MPG20005("MPG20005","頁面停留超過 30 分鐘"),
	
	/** 未選擇金融機構別. */
	MPG20006("MPG20006","未選擇金融機構別"),
	
	/** 未選擇支付方式 */
	MPG20007("MPG20007","未選擇支付方式"),

	/**
	 * 商店代號錯誤
	 */
	TRA10001("TRA10001","商店代號錯誤"),
	/**
	 * 金額格式錯誤
	 */
	TRA10003("TRA10003"),
	
	/**
	 * 資料加密錯誤
	 */
	TRA10008("TRA10008","資料加密錯誤"),
	/**
	 * 商店代號空白
	 */
	TRA10009("TRA10009","商店代號空白"),
	/**
	 * 商店代號停用
	 */
	TRA10012("TRA10012","商店代號停用"),

	
	/**
	 * 信用卡資格停用
	 */
	TRA10013("TRA10013","信用卡資格停用"),	
	/**
	 * 網路連線失敗
	 */
	TRA10015("TRA10015","網路連線失敗"),
	/**
	 * 信用卡授權失敗
	 */
	TRA10016("TRA10016","信用卡授權失敗"),
	
	/**
	 * 查無該筆交易或該筆交易不為信用卡交易
	 */
	TRA10021("TRA10021","查無該筆交易或該筆交易不為信用卡交易"),

	/**
	 * 此訂單非授權成功狀態，不可請款
	 */
	TRA10026("TRA10026","此訂單非授權成功狀態，不可請款"),
	
	/**
	 * 此訂單已申請過請款，不可重覆請款
	 */
	TRA10027("TRA10027","此訂單已申請過請款，不可重覆請款"),
	
	/**
	 * 單號類別錯誤
	 */
	TRA10032("TRA10032","單號類別錯誤"),
	
	/**
	 * 商店訂單編號空白或智付通交易序號空白
	 */
	TRA10033("TRA10033","商店訂單編號空白或智付通交易序號空白"),
	
	/**
	 * 該交易非授權成功或已請款完成狀態，請確認
	 */
	TRA10035("TRA10035","該交易非授權成功或已請款完成狀態，請確認"),
	
	/**
	 * RespondType 欄位資料格式錯誤
	 */
	TRA10036("TRA10036","RespondType 欄位資料格式錯誤"),	
	
	/**
	 * 商家自訂單號錯誤,只允許英數與底線
	 */
	TRA10037("TRA10037","商家自訂單號錯誤,只允許英數與底線"),
	
	/**
	 * 智付通交易序號格式錯誤
	 */
	TRA10038("TRA10038","智付通交易序號格式錯誤"),
	
	/**
	 *NotifyURL 網址格式錯誤
	 */
	TRA10041("TRA10041","NotifyURL 網址格式錯誤"),
	/**
	 * 卡號格式錯誤
	 */
	TRA10042("TRA10042","卡號格式錯誤"),
	/**
	 * 信用卡到期日格式錯誤
	 */
	TRA10043("TRA10043","信用卡到期日格式錯誤"),
	/**
	 *末三碼或到期日格式錯誤或空白
	 */
	TRA10044("TRA10044","末三碼或到期日格式錯誤或空白"),
	
	/**
	 *該筆交易今日已退款
	 */
	TRA10045("TRA10045","該筆交易今日已退款"),
	
	
	
	/**
	 *交易非授權成功狀態
	 */
	TRA10047("TRA10047","交易非授權成功狀態"),
	
	/**
	 *該交易正在請款狀態
	 */
	TRA10048("TRA10048","該交易正在請款狀態"),
	
	/**
	 *該交易正在退款狀態
	 */
	TRA10049("TRA10049","該交易正在退款狀態"),
	
	/**
	 *金額不符
	 */
	TRA10050("TRA10050","金額不符"),
	
	/**
	 *取消授權失敗
	 */
	TRA10051("TRA10051","取消授權失敗"),
	
	/**
	 * 檢查碼(CheckValue)有誤
	 */
	TRA10054("TRA10054","檢查碼(CheckValue)有誤"),
	
	/**
	 * 分期交易非全額請款或退款
	 */
	TRA10058("TRA10058","分期交易非全額請款或退款"),
	
	
	/**
	 * 新增交易訂單失敗,提示訂單編號重複或其他失敗原因
	 */
	TRA10075("TRA10075","新增交易訂單失敗,提示訂單編號重複或其他失敗原因"),
	/**
	 * Token 標記有效年月-數字格式錯誤
	 */
	TRA10096("TRA10096","Token 標記有效年月-數字格式錯誤"),
	/**
	 * Token 標記有效年月-月份格式錯誤
	 */
	TRA10097("TRA10097","Token 標記有效年月-月份格式錯誤"),
	/**
	 * Token 標記有效年月-設定錯誤(已過期)
	 */
	TRA10098("TRA10098","Token 標記有效年月-設定錯誤(已過期)"),
	/**
	 * Token 付款人綁定資料不可空白
	 */
	TRA10100("TRA10100","Token 付款人綁定資料不可空白"),
	/**
	 * 使用 Token 交易無法提供分期付款
	 */
	TRA101("TRA10075","使用 Token 交易無法提供分期付款"),
	/**
	 * 使用 Token 交易無法提供分期付款
	 */
	TRA10101("TRA10101","使用 Token 交易無法提供分期付款"),
	
	/**
	 * 金融機構取消授權批次處理中
	 */
	TRA20001("TRA20001","金融機構取消授權批次處理中"),
	
	
	/**
	 * 商店訂單編號重覆
	 */
	TRA20004("TRA20004","商店訂單編號重覆"),
	
	/**
	 * 該筆交易已請款
	 */
	TRA20011("TRA20011","該筆交易已請款"),
	
	/**
	 * 資料不可空白
	 */
	TRA40008("TRA40008","資料不可空白"),
	
	/**
	 * 資料傳遞錯誤
	 */
	TRA40012("TRA40012","資料傳遞錯誤"),
	/**
	 * 資料不齊全
	 */
	TRA40013("TRA40013","資料不齊全"),
	 
	
	/**
	 * TimeStamp 欄位錯誤
	 */
	TRA40014("TRA40014","TimeStamp 欄位錯誤"),
	
	  
	AMR10001("AMR10001","PartnerID_不可為空白。"),
	AMR10002("AMR10002","PostData_不可為空白。"),
	AMR10003("AMR10003","加密資料有誤,請確認 Hash_Key 與 Hash_IV 是否正確。"),
	AMR10004("AMR10004","不允許 IP。"),
	AMR10005("AMR10005","Version 請固定代 1.0。"),
	AMR10006("AMR10006","商店代號需為金流合作推廣商代號開頭,且長度必須小於 15 字元。"),
	AMR10007("AMR10007","身分證字號或統一編號格式錯誤。"),
	AMR10029("AMR10029","身份證發證日期格式錯誤。"),
	AMR10030("AMR10030","身份證發證地點格式錯誤。"),
	AMR10008("AMR10008","會員電話格式錯誤。"),
	AMR10009("AMR10009","管理者行動電話號碼格式錯誤,請填入 09xxxxxxxx 格式。"),
	AMR10010("AMR10010","管理者 Email 格式有誤,請確認。"),
	AMR10011("AMR10011","金融機構代碼必為三個數字。"),
	AMR10012("AMR10012","金融機構分行代碼必為四個數字。"),
	AMR10013("AMR10013","金融機構帳號,最少 10 個數字,最多 14 個數字。"),
	AMR10014("AMR10014","該商店代碼已經存在無法建立。"),
	AMR10015("AMR10015","PartnerID_不存在。"),
	AMR10016("AMR10016","管理者姓名不可為空白且不可以大於 20 個字元。"),
	AMR10031("AMR10031","管理者英文姓名不可為空白且不可以大於 20 個字元。"),
	AMR10017("AMR10017","管理者帳號不可為空白且,不可以大於 20 個字元。"),
	AMR10018("AMR10018","會員名稱不可為空白且不可以大於 20 個字元。(個人會員) 會員名稱不可為空白且不可以大於 60 個字元。(企業會員)"),
	AMR10019("AMR10019","連絡地址-城市不可為空白且不可以大於 5 個字元。"),
	AMR10020("AMR10020","(1)連絡地址-地區不可為空白且不可以大於 5 個字元。(2)連絡地址-郵遞區號不可為空白且不可以大於 3 個字元。"),
	AMR10021("AMR10021","(1)販售商品型態只可帶入 1、2、3、4 其中一個數值。(2)支付方式格式設定錯誤。(3)支付方式設定錯誤,設定值只能為 0 或 1。(4)支付方式不存在。"),
	AMR10022("AMR10022","(1)交易手續費設定錯誤,請確認參數結構是否正確。(2)交易手續費設定錯誤,設定值需為數字。(3)交易手續費設定錯誤,支付方式不存在。(4)交易手續費設定錯誤,需先設定支付方式啟用才可設定交易手續費。(5)"),
	交易手續費設定超過("交易手續費設定超過","約定區間。"),
	AMR10023("AMR10023","商店連絡地址-路名及門牌號碼不可空白。"),
	AMR10024("AMR10024","設立登記營業國家(英文名)不可空白。設立登記營業城市(英文名)不可空白。"),
	AMR10025("AMR10025","商店簡介不可空白。"),
	AMR10026("AMR10026","商店英文名不可空白。"),
	AMR10032("AMR10032","商店網址格式錯誤。"),
	AMR10027("AMR10027","設立商品類別錯誤,此類別不存在。"),
	AMR10028("AMR10028","(1)撥款天數設定錯誤,請確認參數結構是否正確。(2)撥款天數設定值需為數字。(3)撥款天數設定錯誤,支付方式不存在。(4)需先設定支付方式啟用才可設定撥款天數。(5)撥款天數設定超過約定區間。"),
	AMR10033("AMR10033","信用卡自動請款格式錯誤"),
	AMR10034("AMR10034","(1)不允許設定信用卡額度(2)信用卡額度格式錯誤(3)信用卡額度不可大於約定值(4)修改信用卡額度失敗"),
	AMR10035("AMR10035","(1)設立登記營業國家(英文名)只容許大小寫英文。(2)設立登記營業城市(英文名)只容許大小寫英文。"),
	AMR20001("AMR20001","公司統編重覆,請重新輸入。"),
	AMR20002("AMR20002","企業名稱已存在,請重新輸入。"),
	AMR20003("AMR20003","公司資料新增失敗。"),
	AMR20005("AMR20005","身分證字號已存在,請重新輸入。"),
	AMR20007("AMR20007","查無會員資料。"),
	AMR20008("AMR20008","會員帳號已重複。"),
	AMR20009("AMR20009","會員註冊失敗。"),
	AMR20010("AMR20010","網路連線中斷。"),
	AMR20011("AMR20011","查無商店資料。"),
	AMR20012("AMR20012","新增會員金融機構帳戶失敗。"),
	AMR20013("AMR20013","商店資料新增失敗。"),
	AMR20014("AMR20014","金融機構帳戶資料重覆。"),
	AMR20015("AMR20015","金融機構代號不存在。"),
	MOD10001("MOD10001","PartnerID_不可為空白。"),
	MOD10002("MOD10002","PostData_不可為空白。"),
	MOD10003("MOD10003","PartnerID_錯誤"),
	MOD10004("MOD10004","加密資料有誤,請確認 Hash_Key 與 Hash_IV 是否正確。"),
	 
	MOD10005("MOD10005","不允許 IP。商店代號不可為空白"),
	MOD10006("MOD10006","商店代號需為金流合作推廣商代號開頭,且長度必須小於 15 字元。"),
	MOD10007("MOD10007","查無商店資料"),
	MOD10008("MOD10008","會員電話格式錯誤"),
	MOD10009("MOD10009","如需修改地址,MerchantAddrCity、MerchantAddrArea、MerchantAddrCode、MerchantAddr 皆需帶值"),
	MOD10010("MOD10010","連絡地址-城市不可為空白且不可以大於 5 個字元"),
	MOD10011("MOD10011","連絡地址-地區不可為空白且不可以大於 5 個字元"),
	MOD10012("MOD10012","連絡地址-郵遞區號不可為空白且不可以大於 3 個字元"),
	MOD10013("MOD10013","如需新增帳戶,BankCode、SubBankCode、BankAccount、MemberName 皆需帶值"),
	MOD10014("MOD10014","金融機構代碼必為三個數字"),
	MOD10015("MOD10015","金融機構分行代碼必為四個數字"),
	MOD10016("MOD10016","金融機構帳號,最少 10 個數字,最多 14 個數字"),
	MOD10017("MOD10017","信用卡 3D 驗證只能改為 3D"),
	MOD10018("MOD10018","商店尚未開通不得變更營運狀態"),
	MOD10019("MOD10019","商店狀態只允許帶入參數 1(營運中)或 2(暫停)"),
	MOD10020("MOD10020","無權限設定[支付方式],請拿掉此參數(PaymentType)"),
	MOD10021("MOD10021","無權限設定[撥款天期],請拿掉此參數(AgreedDay)"),
	MOD10022("MOD10022","無權限設定[交易手續費],請拿掉此參數(AgreedFee)"),
	MOD10023("MOD10023","(1).支付方式設定錯誤,請確認格式是否正確 (2).各支付方式原狀態為未啟用、啟用、暫停才能修改支付方式 (3)該支付方式設定錯誤,設定值只能為 1 啟用或 2 暫停 (4)支付方式設定錯誤,該支付方式不存在 (5)付方式設定錯誤,金流合作推廣商不啟用該支付方式"),
	MOD10024("MOD10024","(1)交易手續費設定錯誤,請確認格式是否正確 (2)交易手續費設定錯誤,設定值需為數字 (3)交易手續費設定錯誤,該支付方式不存在(4)該交易手續費設定錯誤,超過約定區間之上下限"),

	;
	
	private String code;
	private String des;
	
	TaxiStatus (String code) {
		this.code = code;
	}
	TaxiStatus (String code, String des) {
		this.code = code;
		this.des = des;
	}
	/**
	 * 
	 * @param code
	 * @return CreditCardStatus
	 */
	public static TaxiStatus find(String code) {
		
		for (TaxiStatus value : TaxiStatus.values()) {
			if (StringUtils.equals(code, value.code)) {
				return value;
			}
		}
		
		return null;
	}
	
	/**
	 * @param code
	 * @return CreditCardStatus
	 */
	public static TaxiStatus find(int code) {
		
		String sCode = String.valueOf(code);
		
		for (TaxiStatus value : TaxiStatus.values()) {
			if (StringUtils.equals(sCode, value.code)) {
				return value;
			}
		}
		
		return null;
	}
	public String getDes() {
		return des;
	}
	
}
